app/views/posts/_form.html.erb

  <label> Categories  </label>
  <%= form.select :category_id, Category.all.collect {|c| [c.name, c.id]} %>
---
SELECT "categories".* FROM "categories"