app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.account_id = current_account.id  if account_signed_in?

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("category_id", "title", "content", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 5], ["title", "uniform sale"], ["content", "ghfhj"], ["created_at", "2020-03-01 20:20:25.849266"], ["updated_at", "2020-03-01 20:20:25.849266"], ["account_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2020-03-02 17:52:12.330954"], ["id", 4]]