app/controllers/public_controller.rb

    def home
        @categories = Category.where(parent_id: nil)
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = $1  [["parent_id", 1]]